DataProcessors/MRS_АРМ_Закрытия_смены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>MRS_АРМ_Закрытия_смены</Name>
			<Comment>Швецов. 17.02.2026. АРМ Закрытия смены</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетСверка</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФронтСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыКасс</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассаККМ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФронтСистема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТочкиПродаж</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеТочкиПродаж</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/MRS_АРМ_Закрытия_смены/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ВыполнитьЗагрузкуДанных() Экспорт
	
	Если ФронтСистема = Перечисления.ПЛ_ТипыФронтСистем.TNG Тогда
		
		MRS_МенеджерОбменаTNG.ВыполнитьЗагрузкуДанныхTNG(ФронтСистема, НачалоПериода, КонецПериода, ПараметрыКасс, НомерЧека);
		
	Иначе
		
		MRS_МенеджерОбменаMicros.ВыполнитьЗагрузкуДанныхMicros(ФронтСистема, НачалоПериода, КонецПериода, ПараметрыКасс, НомерЧека);	
		
	КонецЕсли;	
		
КонецПроцедуры 

Процедура ПолучитьОтчетСверки(СтруктураОтбора) Экспорт
	
	Отчет = Отчеты.MRS_ПродажиФронтСистем.Создать();
	
	Если ФронтСистема = Перечисления.ПЛ_ТипыФронтСистем.TNG Тогда
		
		СхемаКомпоновкиДанных = Отчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); //для TNG
		
		ТаблицаДанных = MRS_МенеджерОбменаTNG.ВыполнитьПолучениеДанныхTNG(ФронтСистема, НачалоПериода, КонецПериода, ПараметрыКасс, НомерЧека);
		
		ВнешнийНаборДанных = Новый Структура("ТаблицаЗначений", ТаблицаДанных);
		
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		
		ДобавитьОтборыВОтчет(Настройки, СтруктураОтбора, ФронтСистема);
		
	Иначе
		
		СхемаКомпоновкиДанных = Отчет.ПолучитьМакет("СхемаКомпоновкиMicros");
		
		ТаблицаЗначенийMicros = MRS_МенеджерОбменаMicros.ВыполнитьПолучениеДанныхMicros(ФронтСистема, НачалоПериода, КонецПериода, ПараметрыКасс, НомерЧека);
		
		Запрос = Новый Запрос;
	    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	    Запрос.Текст = "ВЫБРАТЬ
	                   |	ТЗ.MRS_IDOracleЧекОбщепита КАК MRS_IDOracleЧекОбщепита,
	                   |	ТЗ.НОМЕРТОЧКИПРОДАЖORACLE КАК НОМЕРТОЧКИПРОДАЖORACLE
	                   |ПОМЕСТИТЬ ИсходныеДанные
	                   |ИЗ
	                   |	&ТЗ КАК ТЗ
	                   |ГДЕ
	                   |	ТЗ.MRS_IDOracleЧекОбщепита <> 0
	                   |;
	                   |
	                   |////////////////////////////////////////////////////////////////////////////////
	                   |ВЫБРАТЬ
	                   |	ИсходныеДанные.MRS_IDOracleЧекОбщепита КАК MRS_IDOracleЧекОбщепита
	                   |ПОМЕСТИТЬ ЧекиПоИД
	                   |ИЗ
	                   |	ИсходныеДанные КАК ИсходныеДанные
	                   |
	                   |СГРУППИРОВАТЬ ПО
	                   |	ИсходныеДанные.MRS_IDOracleЧекОбщепита
	                   |
	                   |ИМЕЮЩИЕ
	                   |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫРАЗИТЬ(ИсходныеДанные.НОМЕРТОЧКИПРОДАЖORACLE КАК СТРОКА(5))) > 1
	                   |;
	                   |
	                   |////////////////////////////////////////////////////////////////////////////////
	                   |ВЫБРАТЬ
	                   |	ЧекиПоИД.MRS_IDOracleЧекОбщепита КАК MRS_IDOracleЧекОбщепита
	                   |ИЗ
	                   |	ЧекиПоИД КАК ЧекиПоИД";
	    
	    Запрос.Параметры.Вставить("ТЗ", ТаблицаЗначенийMicros);
	    Результат = Запрос.Выполнить().Выгрузить();
	    МассивОбъединенныхИД = Результат.ВыгрузитьКолонку("MRS_IDOracleЧекОбщепита");
		
	    ТаблицаЗначенийMicros.Колонки.Добавить("Объединен", Новый ОписаниеТипов("Булево"));
	    Для Каждого Строка Из ТаблицаЗначенийMicros Цикл
	      Строка.Объединен = (МассивОбъединенныхИД.Найти(Строка.MRS_IDOracleЧекОбщепита) <> Неопределено);
	    КонецЦикла;
	    
	    ВнешнийНаборДанных = Новый Структура("ТаблицаЗначенийMicros", ТаблицаЗначенийMicros);
	    
	    Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	    
	    ДобавитьОтборыВОтчет(Настройки, СтруктураОтбора, ФронтСистема);
		
	КонецЕсли;
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);
	
	ОтчетСверка.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ПроцессорВывода.УстановитьДокумент(ОтчетСверка); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

Процедура ДобавитьОтборыВОтчет(Настройки, СтруктураОтбора, ФронтСистема)

	// Если есть хоть один активный отбор, создаем группу "ИЛИ" (или "И" — см. ниже)
		Если СтруктураОтбора.ВсеОтклонения Или СтруктураОтбора.ЧекНеНайден Или СтруктураОтбора.ЧекиАлкоголь Или СтруктураОтбора.ОтклоненияПоСумме Или СтруктураОтбора.НоменклатураНеЗаполнена Тогда
			
			// Создаем группу с типом "ИЛИ" для комбинирования условий
			ГруппаОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			ГруппаОтбора.Использование = Истина;

			// Все отклонения (комбинация всех условий)
			Если СтруктураОтбора.ВсеОтклонения Тогда
				// Нет чека общепита
				ЭлементОтбораКасса = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбораКасса.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЧекОбщепита");
				ЭлементОтбораКасса.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
				ЭлементОтбораКасса.Использование = Истина;

				// Не заполнена номенклатура
				ЭлементОтбораЧек = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбораЧек.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НоменклатураЧекОбщепита");
				ЭлементОтбораЧек.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
				ЭлементОтбораЧек.Использование = Истина;
				
				Если ФронтСистема <> Перечисления.ПЛ_ТипыФронтСистем.TNG Тогда 
					// Чеки с алкоголем 
					ЭлементОтбораАлкоголь = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбораАлкоголь.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НоменклатураАлкогольВЛитрах");
					ЭлементОтбораАлкоголь.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					ЭлементОтбораАлкоголь.ПравоеЗначение = Истина;
					ЭлементОтбораАлкоголь.Использование = Истина;
				КонецЕсли;
				
				// Отклонения по сумме
				ЭлементОтбораСумма = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбораСумма.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РазницаСумм");
				ЭлементОтбораСумма.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
				ЭлементОтбораСумма.ПравоеЗначение = 0;
				ЭлементОтбораСумма.Использование = Истина;
			Иначе
				// Индивидуальные отборы
				Если СтруктураОтбора.ЧекНеНайден Тогда
					ЭлементОтбораКасса = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбораКасса.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЧекОбщепита");
					ЭлементОтбораКасса.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
					ЭлементОтбораКасса.Использование = Истина;
				КонецЕсли;

				Если СтруктураОтбора.ЧекиАлкоголь и ФронтСистема <> Перечисления.ПЛ_ТипыФронтСистем.TNG Тогда
					ЭлементОтбораАлкоголь = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбораАлкоголь.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НоменклатураАлкогольВЛитрах");
					ЭлементОтбораАлкоголь.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					ЭлементОтбораАлкоголь.ПравоеЗначение = Истина;
					ЭлементОтбораАлкоголь.Использование = Истина;
				КонецЕсли;

				Если СтруктураОтбора.ОтклоненияПоСумме Тогда
					ЭлементОтбораСумма = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбораСумма.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РазницаСумм");
					ЭлементОтбораСумма.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
					ЭлементОтбораСумма.ПравоеЗначение = 0;
					ЭлементОтбораСумма.Использование = Истина;
				КонецЕсли;

				Если СтруктураОтбора.НоменклатураНеЗаполнена Тогда
					ЭлементОтбораЧек = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбораЧек.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НоменклатураЧекОбщепита");
					ЭлементОтбораЧек.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
					ЭлементОтбораЧек.Использование = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
КонецПроцедуры

// Загружает в ТЧ обработки кассы ККМ кассовых узлов
Процедура ЗагрузитьПараметрыФормы() Экспорт
	
	ПараметрыКасс.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КассыККМ.Ссылка КАК Ссылка,
	|	ПЛ_СоответствиеСФронтСистемами.ФронтСистема КАК ФронтСистема,
	|	ПЛ_СоответствиеСФронтСистемами.Код КАК Код,
	|	ПЛ_СоответствиеСФронтСистемами.НаименованиеКнопки КАК НаименованиеКнопки
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПЛ_СоответствиеСФронтСистемами КАК ПЛ_СоответствиеСФронтСистемами
	|		ПО КассыККМ.Ссылка = ПЛ_СоответствиеСФронтСистемами.Объект.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК Использовать,
	|	ВременнаяТаблица.Ссылка КАК КассаККМ,
	|	ВременнаяТаблица.ФронтСистема КАК ФронтСистема,
	|	ВременнаяТаблица.Код КАК КодТочкиПродаж,
	|	ВременнаяТаблица.НаименованиеКнопки КАК НаименованиеТочкиПродаж
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|ГДЕ
	|	ВременнаяТаблица.ФронтСистема В(&ФронтСистема)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассаККМ";
	
	ФронтСистемаМассив = Новый Массив;
	ФронтСистемаМассив.Добавить(Перечисления.ПЛ_ТипыФронтСистем.TNG); // TNG
	ФронтСистемаМассив.Добавить(Перечисления.ПЛ_ТипыФронтСистем.Micros);
	
	Если ЗначениеЗаполнено(ФронтСистема) Тогда
		
		Запрос.УстановитьПараметр("ФронтСистема", ФронтСистема);
		
	Иначе
		
		Запрос.УстановитьПараметр("ФронтСистема", ФронтСистемаМассив);
		
	КонецЕсли;
	
	ПараметрыКасс.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 

#КонецОбласти

#КонецЕсли
